app/Controllers/AdminKab.php

    public function data_peternak()
    {
        $peternakModel = new PeternakModel;
        $id_kab = session()->get("user")["id"];
        $data = array(
            "page" => "Admin/kabupaten/data_peternak.php",
            "data_peternak" => $peternakModel->join("admin_kabupaten", "admin_kabupaten.id_kab=pemilik_ternak.id_kab", "left")->where("pemilik_ternak.id_kab", $id_kab)->findAll(80)
        );
---
SELECT *
FROM `pemilik_ternak`
LEFT JOIN `admin_kabupaten` ON `admin_kabupaten`.`id_kab`=`pemilik_ternak`.`id_kab`
WHERE `pemilik_ternak`.`id_kab` = '9108'
 LIMIT 80

    public function input_jadwal()
    {
        $validation = \Config\Services::validation();
        $jadwalVaksinModel = new JadwalVaksinModel;
        $id_jadwal = $this->request->getVar("id_jadwal");
        $data = array(
            "id_vaksin" => $this->request->getPost("id_vaksin"),
            "tgl_pemberian" => $this->request->getPost("tgl_pemberian")
        );
        $rules = [
            'id_vaksin' => [
                'rules'  => 'required',
                'errors' => [
                    'required' => 'ID Vaksin harus diisi.',
                ],
            ],
            'tgl_pemberian' => [
                'rules'  => 'required',
                'errors' => [
                    'required' => 'Tanggal pemberian harus diisi.',
                ],
            ]
        ];
        $validation->setRules($rules);
        if ($validation->run($data)) {
            if ($id_jadwal == "") {
                $jadwalVaksinModel->insert($data);
---
INSERT INTO `jadwal_vaksin` (`id_vaksin`, `tgl_pemberian`) VALUES ('3', '2024-03-05')

    public function data_dokumentasi_detail($id_jadwal)
    {
        $dokumentasiModel = new DokumentasiModel;
        $data["data"] = $dokumentasiModel->where("id_jadwal", $id_jadwal)->findAll();
---
SELECT *
FROM `dokumentasi`
WHERE `id_jadwal` = '6'