app/Controllers/AdminKab.php

    public function data_peternak()
    {
        $peternakModel = new PeternakModel;
        $usulanModel = new UsulanModel;
        $id_kab = session()->get("user")["id"];
        $data = array(
            "page" => "Admin/kabupaten/data_peternak.php",
            "data_peternak" => $peternakModel->select(
                "
                    pemilik_ternak.nik,
                    pemilik_ternak.id_usulan,
                    pemilik_ternak.id_kab,
                    pemilik_ternak.nama_pemilik,
                    pemilik_ternak.alamat AS alamat_pemilik,
                    pemilik_ternak.no_hp AS no_hp_pemilik,
                    pemilik_ternak.jumlah_ternak AS jumlah_ternak_pemilik,
                    admin_kabupaten.nama_kabupaten,
                    usulan.nama AS usulan_vaksin,
                    usulan.alamat AS alamat_usulan,
                    usulan.no_hp AS no_hp_usulan,
                    usulan.jumlah_ternak AS jumlah_ternak_usulan
                "
            )->join(
                "admin_kabupaten",
                "admin_kabupaten.id_kab=pemilik_ternak.id_kab",
                "left"
            )->join(
                "usulan",
                "usulan.id=pemilik_ternak.id_usulan",
                "left"
            )
                ->where("pemilik_ternak.id_kab", $id_kab)->findAll(80)
        );
---
SELECT `pemilik_ternak`.`nik`, `pemilik_ternak`.`id_usulan`, `pemilik_ternak`.`id_kab`, `pemilik_ternak`.`nama_pemilik`, `pemilik_ternak`.`alamat` AS `alamat_pemilik`, `pemilik_ternak`.`no_hp` AS `no_hp_pemilik`, `pemilik_ternak`.`jumlah_ternak` AS `jumlah_ternak_pemilik`, `admin_kabupaten`.`nama_kabupaten`, `usulan`.`nama` AS `usulan_vaksin`, `usulan`.`alamat` AS `alamat_usulan`, `usulan`.`no_hp` AS `no_hp_usulan`, `usulan`.`jumlah_ternak` AS `jumlah_ternak_usulan`
FROM `pemilik_ternak`
LEFT JOIN `admin_kabupaten` ON `admin_kabupaten`.`id_kab`=`pemilik_ternak`.`id_kab`
LEFT JOIN `usulan` ON `usulan`.`id`=`pemilik_ternak`.`id_usulan`
WHERE `pemilik_ternak`.`id_kab` = '9108'
 LIMIT 80

    public function data_dokumentasi_detail($idPeserta)
    {
        $dokumentasiModel = new DokumentasiModel;
        $data["data"] = $dokumentasiModel->where("id_peserta", $idPeserta)->findAll();
---
SELECT *
FROM `dokumentasi`
WHERE `id_peserta` = '5'

    public function detail_peserta_edit()
    {
        $pesertaModel = new PesertaModel;
        $jadwalVaksinModel = new JadwalVaksinModel;
        $peternakModel = new PeternakModel;
        $jenisVaksinModel = new JenisVaksinModel;
        $id_kab = session()->get("user")["id"];
        $idVaksin = $this->request->getVar("id_vaksin");
        $idPeserta = $this->request->getVar("id_peserta");
        $data = array(
            "jadwal_vaksin" => $jadwalVaksinModel->findAll(),
            "data_peternak" => $peternakModel->where("id_kab", $id_kab)->findAll(),
            "data_peserta" => $pesertaModel->where("id", $idPeserta)->first(),
            "jenis_vaksin" => $jenisVaksinModel->findAll()
        );
---
SELECT *
FROM `jenis_vaksin`