app/Controllers/Auth.php

SELECT *
FROM `user`
WHERE `username` = 'admin'
AND `password` = '12345'
 LIMIT 1
---
    public function save_auth()
    {
        $userModel = new UserModel;
        $kabupatenModel = new KabupatenModel;
        $username = $this->request->getPost("username");
        $password = $this->request->getPost("password");
        $role = $this->request->getPost("role");
        if ($role == "admin_prov") {
            $adminData = $userModel->where("username", $username)->where("password", $password)->first();