app/Controllers/Landingpage.php

    public function jenis_vaksin($idKab)
    {
        $distribusiModel = new DistribusiVaksinModel;
        $data = array(
            "data_vaksin" => $distribusiModel->select(
                "
                    distribusi_vaksin.id_jenis_vaksin,
                    jenis_vaksin.jenis_vaksin
                "
            )->join(
                "jenis_vaksin",
                "jenis_vaksin.id=distribusi_vaksin.id_jenis_vaksin",
                "left"
            )->where(
                "distribusi_vaksin.id_kabupaten",
                $idKab
            )->groupBy("id_jenis_vaksin")->findAll(),
            "kab" => $idKab
        );
---
SELECT `distribusi_vaksin`.`id_jenis_vaksin`, `jenis_vaksin`.`jenis_vaksin`
FROM `distribusi_vaksin`
LEFT JOIN `jenis_vaksin` ON `jenis_vaksin`.`id`=`distribusi_vaksin`.`id_jenis_vaksin`
WHERE `distribusi_vaksin`.`id_kabupaten` = '9101'
GROUP BY `id_jenis_vaksin`